
import json
from datetime import datetime
 
parties=[
  "नेपाली काँग्रेस",
  "नेपाल कम्युनिष्ट पार्टी (एकीकृत मार्क्सवादी-लेनिनवादी)",
  "नेपाल कम्युनिष्ट पार्टी (माओवादी केन्द्र)",
  "राष्ट्रिय प्रजातन्त्र पार्टी ",
  "संघीय समाजवादी फोरम, नेपाल ",
  "मधेशी जनअधिकार फोरम, नेपाल (लोकतान्त्रिक)",
  "तराइ मधेश लोकतान्त्रिक पार्टी ",
  "सद्भावना पार्टी ",
  "नेपाल कम्युनिष्ट पार्टी (मार्क्सवादी–लेनिनवादी)",
  "राष्ट्रिय जनमोर्चा ",
  "नेपाल कम्युनिष्ट पार्टी (संयुक्त)",
  "राष्ट्रिय जनता पार्टी नेपाल",
  "नेपाल मजदुर किसान पार्टी ",
  "तराई मधेश सद्भावना पार्टी नेपाल",
  "थरुहट तराई पार्टी नेपाल  ",
  "नेपाल परिवार दल ",
  "बहुजन शक्ति पार्टी ",
  "अखण्ड नेपाल पार्टी",
  "मधेशी जनअधिकार फोरम (गणतान्त्रिक)",
  "नेपाली जनता दल ",
  "खम्वुवान राष्ट्रिय मोर्चा, नेपाल ",
  "जनजागरण पार्टी नेपाल",
  "नेपाल सद्भावना पार्टी",
  "मधेश समता पार्टी नेपाल ",
  "संघीय लोकतान्त्रिक राष्ट्रिय मञ्च (थरुहट)",
  "दलित जनजाति पार्टी नेपाल",
  "राष्ट्रिय जनमुक्ति पार्टी (लोकतान्त्रिक) नेपाल",
  "ग्रीन पार्टी नेपाल",
  "मुस्कान सेना नेपाल",
  "चुरेभावर लोकतान्त्रिक पार्टी",
  "राष्ट्रिय मुक्ति आन्दोलन, नेपाल ",
  "राष्ट्रिय त्रिमुल बहुजन समाजवादी पार्टी",
  "राष्ट्रिय यथार्थवादी पार्टी नेपाल",
  "नेपाल समावेशी पार्टी",
  "नेपाल जनता पार्टी",
  "नेपाल आमा पार्टी",
  "मधेश तराई फोरम ",
  "नेपाल कम्युनिष्ट पार्टी (माक्र्सवादी)",
  "नेपाल कम्युनिष्ट पार्टी",
  "मधेशी जनअधिकार फोरम मधेश ",
  "संघीय लोकतान्त्रिक राष्ट्रिय मञ्च",
  "नेपाल कम्युनिष्ट पार्टी (माले – समाजवादी) ",
  "शिवसेना नेपाल",
  "शान्ति पार्टी नेपाल ",
  "नेपाल सकुम्बासी पार्टी (लोकतान्त्रिक)",
  "बहुजन समाज पार्टी नेपाल",
  "देशभक्त पर्यावरणीय सामाजिक (देपसा) मोर्चा  ",
  "राष्ट्रवादी एकता पार्टी",
  "तामाङसालिङ लोकतान्त्रिक पार्टी ",
  "लोक दल",
  "देशभक्त समाज",
  "जनशक्ति नेपाल",
  "मितेरी पार्टी नेपाल",
  "राष्ट्रिय चुरेभावर पार्टी",
  "राष्ट्रिय शिवसेना पार्टी",
  "अखण्ड सुदूरपश्चिम पार्टी नेपाल",
  "नेपाल प्रजातान्त्रिक प्रगतिशिल पार्टी  ",
  "चुरेभावर राष्ट्रिय पार्टी",
  "पिछडावर्ग निषाद दलित जनजाति पार्टी  ",
  "लिबरल डेमोक्रेटिक पार्टी",
  "राष्ट्रिय जनमुक्ति पार्टी",
  "जनसमाजवादी पार्टी, नेपाल",
  "चुरेभावर राष्ट्रिय एकता पार्टी नेपाल",
  "राष्ट्रिय जनता दल नेपाल",
  "लोक कल्याणकारी जनता पार्टी, नेपाल",
  "नेपाल समाजवादी पार्टी (लोहियावादी)",
  "नेपाल दलित पार्टी",
  "नयाँ शक्ति पार्टी, नेपाल",
  "विवेकशील नेपाली दल",
  "समाजवादी जनता पार्टी",
  "गान्धीवादी पार्टी नेपाल",
  "राष्ट्रवादी पार्टी",
  "नेपाल पूर्वराष्ट्रसेवक लोकतान्त्रिक पार्टी",
  "नेपाल जनलोकतन्त्र पार्टी",
  "नेपाल पिपुल्स पार्टी",
  "राष्ट्रिय जन एकता पार्टी",
  "हाम्रो पार्टी",
  "हाम्रो नेपाल पार्टी",
  "युवा  नेपाल पार्टी",
  "नेपाल लोकतान्त्रिक जनता कांग्रेस पार्टी",
  "नेपाल लोकतान्त्रिक फोरम",
  "राष्ट्रिय प्रजातन्त्र पार्टी  (प्रजातान्त्रिक)",
  "एकीकृत राष्ट्रिय प्रजातन्त्र पार्टी (राष्ट्रवादी ) ",
  "स्वतन्त्र"
]
from MySQLdb import _mysql

def get_party_name():
    db = _mysql.connect("localhost","root","Anonymous@123!@#","election_new")
    open_list ={}
    for i in parties:        
        open_list['party_name'] = i
        open_list['party_code'] = ""
        open_list['status'] = 1
        open_list['declaration_text'] =""
        open_list['created_at'] = datetime.now()
        open_list['updated_at']=datetime.now()
        a="""insert into election_new.ys_election_party (party_name,party_code,status,declaration_text,created_at,updated_at) values ('%s','%s','%s','%s','%s','%s');""" % (i,"",1,"",datetime.now(),datetime.now())
        try:
          db.query(a)
        except Exception as exc:
          print(exc)

get_party_name()